<h2>Pandas is open source library built on top of NumPy
fast data analysis
built-in visualization features
it can work with data from wide variety of sources</h2>

# Installation Command
pip install pandas

conda install pandas

# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
d

{'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# using dict to create Series
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# Numpy array -> series
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [10]:
# series can hold variety of datatypes
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
# hosting fuction in Series
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

In [17]:
ser1.iloc[0]

1

In [18]:
ser3 = pd.Series(data=labels)

In [19]:
ser3

0    a
1    b
2    c
dtype: object

In [20]:
# getting data using index labels
ser3[0]

'a'

In [23]:
# operation based index
# when it didn't find the match it put NaN at that place
# pandas and numpy always return result as a float
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [24]:
from numpy.random import randn

In [25]:
# make sure to get the same random number on each machine
np.random.seed(101)

In [27]:
df = pd.DataFrame(randn(5,4),list('ABCDE'),list('WXYZ'))

In [28]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
# get column by passing the name
# each column is a separate series
df['W']

pandas.core.series.Series

In [34]:
# SQL synatx to get column
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [35]:
# selecting multiple columns
df[['W',"Z"]]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [37]:
# craeting new column
df['new'] = df['W'] + df['Y']

In [38]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [40]:
# removing columns
# doesn't happen inplace
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [42]:
df.drop('new',axis=1,inplace=True)

In [43]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df.drop('E')

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [46]:
df.shape

(5, 4)

# axis 0 = rows

# axis 1 = columns

# Selecting rows

In [52]:
# accesing the rows using the labels
df.loc[['A','B'],['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502

In [55]:
# selecting rows using index
df.iloc[2:4,2:3]

          Y
C  0.638787
D -0.943406

In [56]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [57]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

# Conditional selection

In [58]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [60]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [61]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [65]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [67]:
# only return rows where condition is true
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [72]:
result = df[df['Z']>0]

In [75]:
result[['X']]

          X
B  0.390528
C  0.072960
D -0.754070
E  1.901755

In [78]:
# stacking commands on top of each other
# one liners notation
df[df['Z']>0][['X']]

          X
B  0.390528
C  0.072960
D -0.754070
E  1.901755

# Multiple condtions

In [85]:
# we can't use pythons noraml and operator while checking the multiple condtions use &
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
# or operator |
df[(df['W']>0) | (df['Y']<1)]

# resetting the index or setting it to something else

In [87]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [89]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [90]:
df.set_index('Z')

                  W         X         Y
Z
-1.159119  0.302665  1.693723 -1.706086
 0.184502 -0.134841  0.390528  0.166905
 0.329646  0.807706  0.072960  0.638787
 0.484752 -0.497104 -0.754070 -0.943406
 1.996652 -0.116773  1.901755  0.238127

In [91]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [92]:
newindx = 'A B C D E'.split()

In [93]:
df['states'] = newindx

In [95]:
df.set_index('states')

               W         X         Y         Z
states
A       0.302665  1.693723 -1.706086 -1.159119
B      -0.134841  0.390528  0.166905  0.184502
C       0.807706  0.072960  0.638787  0.329646
D      -0.497104 -0.754070 -0.943406  0.484752
E      -0.116773  1.901755  0.238127  1.996652

In [96]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119      A
B -0.134841  0.390528  0.166905  0.184502      B
C  0.807706  0.072960  0.638787  0.329646      C
D -0.497104 -0.754070 -0.943406  0.484752      D
E -0.116773  1.901755  0.238127  1.996652      E

# Multi index

In [119]:
#  index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [120]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [124]:
# set the index to the hier_index

df = pd.DataFrame(randn(6,2),hier_index,list('AB'))

In [125]:
df

             A         B
G1 1  0.681209  1.035125
   2 -0.031160  1.939932
   3 -1.005187 -0.741790
G2 1  0.187125 -0.732845
   2 -1.382920  1.482495
   3  0.961458 -2.141212

In [127]:
df.loc['G1'].loc[[1]]

          A         B
1  0.681209  1.035125

In [128]:
df.loc['G1'].loc[[1]]['A']

1    0.681209
Name: A, dtype: float64

In [129]:
df

             A         B
G1 1  0.681209  1.035125
   2 -0.031160  1.939932
   3 -1.005187 -0.741790
G2 1  0.187125 -0.732845
   2 -1.382920  1.482495
   3  0.961458 -2.141212

In [133]:
# setting names for unnamed indexes
df.index.names = ['Groups','Num']

In [134]:
df

                   A         B
Groups Num
G1     1    0.681209  1.035125
       2   -0.031160  1.939932
       3   -1.005187 -0.741790
G2     1    0.187125 -0.732845
       2   -1.382920  1.482495
       3    0.961458 -2.141212

In [138]:
df.loc['G2'].loc[2]['B']

1.48249549608345

In [144]:
# cross section
df.xs(1,level='Num')

               A         B
Groups
G1      0.681209  1.035125
G2      0.187125 -0.732845

# Missing Data

In [145]:
df = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [146]:
df = pd.DataFrame(df)

In [147]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [148]:
# drops all rows which contain 1 or more nan values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [151]:
# operation on columns
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [154]:
# reuires that non nan in order to not get dropped
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [156]:
# fill missing values
df.fillna('Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [158]:
# replacing missing value with mean of column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby function

In [161]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]
       }

In [162]:
df = pd.DataFrame(data)

In [163]:
df

  Company   person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [166]:
# group rows based on column names
byComp = df.groupby('Company')

In [167]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [168]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [169]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [170]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [171]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [172]:
# one line
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [173]:
df.groupby('Company').count()

         person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [175]:
df.groupby('Company').min()

          person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [180]:

df.groupby('Company').describe().T[['FB']]

Company              FB
Sales count    2.000000
      mean   296.500000
      std     75.660426
      min    243.000000
      25%    269.750000
      50%    296.500000
      75%    323.250000
      max    350.000000

# Concatenation glues together dataframes either on axis=0 or on axis=1

In [184]:
# pd.concat([list of dataframes])
# default axis=1
# pd.concat([list of DF],axis=1)

In [185]:
# merge is similar to merging SQL tables together

In [188]:
# pd.merge(df1,df2,how='inner',on='key')
# joining based on the column
# pd.merge(left, right, how='left', on=['key1', 'key2'])

In [189]:
# join based on index keys
# df1.join(df2)

In [190]:
# df1.join(df2,how='inner')

# Operation

In [191]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']
    
})

In [192]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [193]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [194]:
 # finding unique value on df
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [195]:
df['col2'].nuniquenique()

3

In [196]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Selecting data

In [197]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [202]:

df[(df['col1']>2) & (df['col1']==3.)]

   col1  col2 col3
2     3   666  ghi

In [203]:
# apply() method

In [204]:
def times2(x):
    return x*2

In [205]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [206]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [207]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [208]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [209]:
# removing column

In [210]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [211]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [212]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [217]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [218]:
# sorting the dataframe

In [219]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [220]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [221]:
# to check if value if null or not
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [222]:
# pivot table same as excel
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [223]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [225]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [226]:
# Libraries require
# conda install sqlalchemy
# conda install lxml
# conda install html5lib
# conda install BeautifulSoup4

In [227]:
pwd()

'E:\\Data science practice\\03-Python-for-Data-Analysis-Pandas'

In [229]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [235]:
df = pd.read_csv('example')

In [236]:
df.to_csv('My_output',index=False)

In [237]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15